# Series是一种类似于一维数组的对象，它由一组数据（不同数据类型）以及一组与之相关的数据标签（即索引）组成。

import pandas as pd
data= pd.Series([520,'孙兴华',1314,'2020-07-30']) # 左侧是索引，右侧是数据

print(data)
# 返回序列
print(data.values)

print("==============================================================================")

# 指定索引
data= pd.Series([520,'孙兴华',1314,'2020-07-30'],index=['a','b','c','d']) # 左侧是索引，右侧是数据
print(data)


print("==============================================================================")
# 使用python字典创建series
dict={'姓名':'孙兴华','性别':'男','年龄':'20','地址':'花果山水帘洞'}
data=pd.Series(dict)
print(data)




